update admin tools & UX
